Awacky/ros_stm32_freertos/STM32Bsp/HwConfig/hw_STM32F40x_127.h
#ifndef _HW_STM32F40x_H_
#define _HW_STM32F40x_H_
//SYSCLK（系统时钟） =168MHz
//AHB 总线时钟(HCLK=SYSCLK) =168MHz
//APB1 总线时钟(PCLK1=SYSCLK/4) =42MHz
//APB2 总线时钟(PCLK2=SYSCLK/2) =84MHz
//PLL 主时钟 =168MHz

#include "stm32f4xx.h" 
#include "datatypes.h"
#include "modem.h"
#include "delay.h"

#define CHIP_UUID				((uint32_t*)0x1FFF7A10)
#define CHIP_UUID_8				((uint8_t*)0x1FFF7A10)
#define FLASH_SIZE_ADDR			((uint32_t*)0x1FFF7A22)
#define HARDWARE_VER            "STF407VG-V1.2.7"
#define Hw_GPIO_TypeDef			GPIO_TypeDef
#define Hw_TIM_TypeDef			TIM_TypeDef
#define Hw_CLK_TypeDef			uint32_t
#define Hw_TCLK_TypeDef			uint32_t
#define Hw_TIM_CHA_TypeDef		uint16_t
#define Hw_GPIO_Set				BSRRL
#define Hw_GPIO_ReSet			BSRRH

/** --------Serial Config-------- **/
#ifndef BOOTLOADER
#define SERIAL1_CONFIG
#define SERIAL2_CONFIG
#define SERIAL3_CONFIG
#define SERIAL4_CONFIG
#define SERIAL5_CONFIG
#endif

#define LEDRn						    	3
#define LEDPWM_CNT_TOP						200
#define STARBOT_LED_STATUS_PORT				GPIOC
#define STARBOT_LED_STATUS_CLK				RCC_AHB1Periph_GPIOC
#define STARBOT_LED_STATUS_PIN				GPIO_Pin_14
#define STARBOT_LED_STATUS_On()             GPIO_ResetBits(STARBOT_LED_STATUS_PORT,STARBOT_LED_STATUS_PIN)          
#define STARBOT_LED_STATUS_Off()            GPIO_SetBits(STARBOT_LED_STATUS_PORT,STARBOT_LED_STATUS_PIN)  
#define STARBOT_LED_STATUS_Toggle()         GPIO_ToggleBits(STARBOT_LED_STATUS_PORT, STARBOT_LED_STATUS_PIN)

#define STARBOT_LED_RUN_PORT				GPIOA
#define STARBOT_LED_RUN_CLK					RCC_AHB1Periph_GPIOA
#define STARBOT_LED_RUN_PIN					GPIO_Pin_8
#define STARBOT_LED_RUN_On()             	GPIO_SetBits(STARBOT_LED_RUN_PORT,STARBOT_LED_RUN_PIN)     
#define STARBOT_LED_RUN_Off()            	GPIO_ResetBits(STARBOT_LED_RUN_PORT,STARBOT_LED_RUN_PIN) 
#define STARBOT_LED_RUN_Toggle()         	GPIO_ToggleBits(STARBOT_LED_RUN_PORT,STARBOT_LED_RUN_PIN)

#define STARBOT_LED_FAULT_PORT				GPIOC
#define STARBOT_LED_FAULT_CLK				RCC_AHB1Periph_GPIOC
#define STARBOT_LED_FAULT_PIN				GPIO_Pin_15
#define STARBOT_LED_FAULT_On()             	GPIO_ResetBits(STARBOT_LED_FAULT_PORT,STARBOT_LED_FAULT_PIN)         
#define STARBOT_LED_FAULT_Off()            	GPIO_SetBits(STARBOT_LED_FAULT_PORT,STARBOT_LED_FAULT_PIN) 
#define STARBOT_LED_FAULT_Toggle()         	GPIO_ToggleBits(STARBOT_LED_FAULT_PORT,STARBOT_LED_FAULT_PIN)

#define STARBOT_BEEP_PIN					GPIO_Pin_2
#define STARBOT_BEEP_PORT					GPIOE
#define STARBOT_BEEP_CLK					RCC_AHB1Periph_GPIOE
#define STARBOT_BEEP_On()					GPIO_SetBits(STARBOT_BEEP_PORT,STARBOT_BEEP_PIN)
#define STARBOT_BEEP_Off()					GPIO_ResetBits(STARBOT_BEEP_PORT,STARBOT_BEEP_PIN)
#define STARBOT_BEEP_Toggle()				GPIO_ToggleBits(STARBOT_BEEP_PORT,STARBOT_BEEP_PIN)

#define POWER_KEYn 							3
#define STARBOT_POWER_KEY1_PORT				GPIOD
#define STARBOT_POWER_KEY1_CLK    			RCC_AHB1Periph_GPIOD
#define STARBOT_POWER_KEY1_PIN				GPIO_Pin_10 
#define STARBOT_POWER_KEY1_On()				GPIO_SetBits(STARBOT_POWER_KEY1_PORT,STARBOT_POWER_KEY1_PIN)
#define STARBOT_POWER_KEY1_Off()			GPIO_ResetBits(STARBOT_POWER_KEY1_PORT,STARBOT_POWER_KEY1_PIN)
#define STARBOT_POWER_KEY2_PORT				GPIOD
#define STARBOT_POWER_KEY2_CLK    			RCC_AHB1Periph_GPIOD
#define STARBOT_POWER_KEY2_PIN				GPIO_Pin_11
#define STARBOT_POWER_KEY2_On()				GPIO_SetBits(STARBOT_POWER_KEY2_PORT,STARBOT_POWER_KEY2_PIN)
#define STARBOT_POWER_KEY2_Off()			GPIO_ResetBits(STARBOT_POWER_KEY2_PORT,STARBOT_POWER_KEY2_PIN)

#define STARBOT_EMERGENCY_STOP_PORT			GPIOD
#define STARBOT_EMERGENCY_STOP_CLK    		RCC_AHB1Periph_GPIOD
#define STARBOT_EMERGENCY_STOP_PIN			GPIO_Pin_3  
#define STARBOT_EMERGENCY_Check()           PDin(3)

#define IICn 								3
#define SoftwareII_PORT_TypeDef				GPIO_TypeDef
#define SoftwareII_CLK_TypeDef				uint32_t
#define SoftwareIIC_SDA_In()				GPIO_InitTypeDef GPIO_InitStructer;\
											RCC_AHB1PeriphClockCmd(IIC_SDA_PORT_CLK[this->iic], ENABLE);\
											GPIO_InitStructer.GPIO_Pin = IIC_SDA_PIN[this->iic];\
											GPIO_InitStructer.GPIO_Speed=GPIO_Speed_50MHz;\
											GPIO_InitStructer.GPIO_Mode=GPIO_Mode_IN;\
											GPIO_InitStructer.GPIO_OType = GPIO_OType_OD;\
											GPIO_Init(IIC_SDA_PORT[this->iic], &GPIO_InitStructer);
#define SoftwareIIC_SDA_Out()				GPIO_InitTypeDef GPIO_InitStructer;\
											RCC_AHB1PeriphClockCmd(IIC_SDA_PORT_CLK[this->iic], ENABLE);\
											GPIO_InitStructer.GPIO_Pin = IIC_SDA_PIN[this->iic];\
											GPIO_InitStructer.GPIO_Speed=GPIO_Speed_50MHz;\
											GPIO_InitStructer.GPIO_Mode=GPIO_Mode_OUT;\
											GPIO_InitStructer.GPIO_OType = GPIO_OType_OD;\
											GPIO_Init(IIC_SDA_PORT[this->iic], &GPIO_InitStructer);
#define SoftwareIIC_SDA_H()					IIC_SDA_PORT[this->iic]->BSRRL = IIC_SDA_PIN[this->iic];
#define SoftwareIIC_SDA_L()					IIC_SDA_PORT[this->iic]->BSRRH = IIC_SDA_PIN[this->iic];
#define SoftwareIIC_SCL_H()					IIC_SCL_PORT[this->iic]->BSRRL = IIC_SCL_PIN[this->iic];
#define SoftwareIIC_SCL_L()					IIC_SCL_PORT[this->iic]->BSRRH = IIC_SCL_PIN[this->iic];
#define SoftwareIIC_SDA_Read()				IIC_SDA_PORT[this->iic]->IDR&IIC_SDA_PIN[this->iic]

#define STARBOT_IMU_N_SCL_PIN				GPIO_Pin_7
#define STARBOT_IMU_N_SDA_PIN				GPIO_Pin_4
#define STARBOT_IMU_N_SCL_PORT				GPIOD
#define STARBOT_IMU_N_SDA_PORT				GPIOD
#define STARBOT_IMU_N_SCL_CLK    			RCC_AHB1Periph_GPIOD
#define STARBOT_IMU_N_SDA_CLK    			RCC_AHB1Periph_GPIOD
         

#define STARBOT_IMU_W_SCL_PIN				GPIO_Pin_4
#define STARBOT_IMU_W_SDA_PIN				GPIO_Pin_5
#define STARBOT_IMU_W_SCL_PORT				GPIOB
#define STARBOT_IMU_W_SDA_PORT				GPIOB
#define STARBOT_IMU_W_SCL_CLK    			RCC_AHB1Periph_GPIOB
#define STARBOT_IMU_W_SDA_CLK    			RCC_AHB1Periph_GPIOB


#define STARBOT_OLED_SCL_PIN				GPIO_Pin_6
#define STARBOT_OLED_SDA_PIN				GPIO_Pin_7
#define STARBOT_OLED_SCL_PORT				GPIOB
#define STARBOT_OLED_SDA_PORT				GPIOB
#define STARBOT_OLED_SCL_CLK    			RCC_AHB1Periph_GPIOB
#define STARBOT_OLED_SDA_CLK    			RCC_AHB1Periph_GPIOB

/** PSTWO Config **/
//平的为底面，灯面对自己左到右是9-1
//接收器管脚      板子               接板子丝印
//CLK 7          PE15    SPI-SCL     CLK
//CS  6          PB10     CS         CS
//VDD 5                              VCC（不能5V供电！！）
//GND 4                              GND
//DO  2          PB11    SPI-MOSI    DI 
//DI  1          PE10    SPI-MISO    D0
#define STARBOT_PSTWO_CS_PORT				GPIOB
#define STARBOT_PSTWO_CS_CLK    			RCC_AHB1Periph_GPIOB
#define STARBOT_PSTWO_CS_PIN				GPIO_Pin_10         

#define STARBOT_PSTWO_SCL_PORT				GPIOE
#define STARBOT_PSTWO_SCL_CLK    			RCC_AHB1Periph_GPIOE
#define STARBOT_PSTWO_SCL_PIN				GPIO_Pin_15  

