Awacky/ros_stm32_freertos/STM32Bsp/HwConfig/hw_STM32F40x_127.h
#define STARBOT_PSTWO_DI_PORT				GPIOE
#define STARBOT_PSTWO_DI_CLK    			RCC_AHB1Periph_GPIOE
#define STARBOT_PSTWO_DI_PIN				GPIO_Pin_10  

#define STARBOT_PSTWO_DO_PORT				GPIOB
#define STARBOT_PSTWO_DO_CLK    			RCC_AHB1Periph_GPIOB
#define STARBOT_PSTWO_DO_PIN				GPIO_Pin_11  

#define STARBOT_PSTWO_CHECK_PORT			GPIOE
#define STARBOT_PSTWO_CHECK_CLK    			RCC_AHB1Periph_GPIOE
#define STARBOT_PSTWO_CHECK_PIN				GPIO_Pin_12
#define STARBOT_PSTWO_Check()               PEin(12)

#define DI    								PEin(10)      //PE10输入
#define DO_H  								PBout(11)=1   //命令位高
#define DO_L  								PBout(11)=0   //命令位低
#define CS_H  								PBout(10)=1   //CS拉高
#define CS_L  								PBout(10)=0   //CS拉低
#define CLK_H 								PEout(15)=1   //时钟拉高
#define CLK_L 								PEout(15)=0   //时钟拉低

/** -----------Motor Config ---------**/ 
#define MOTORn						        4
#define STARBOT_MOTOR1_A_PIN		 		GPIO_Pin_11
#define STARBOT_MOTOR1_A_PINSOU		 		GPIO_PinSource11
#define STARBOT_MOTOR1_A_GPIO_PORT	 		GPIOE
#define STARBOT_MOTOR1_A_GPIO_CLK	 		RCC_AHB1Periph_GPIOE
#define STARBOT_MOTOR1_B_PIN   	 	   	 	GPIO_Pin_13
#define STARBOT_MOTOR1_B_PINSOU		 		GPIO_PinSource13
#define STARBOT_MOTOR1_B_GPIO_PORT	 		GPIOE
#define STARBOT_MOTOR1_B_GPIO_CLK	 		RCC_AHB1Periph_GPIOE
#define STARBOT_MOTOR1_TIM            		TIM1
#define STARBOT_MOTOR1_TIM_CLK        		RCC_APB2Periph_TIM1
#define STARBOT_MOTOR1_A_CHANNEL			TIM_Channel_2
#define STARBOT_MOTOR1_B_CHANNEL			TIM_Channel_3
#define STARBOT_MOTOR1_AF_TIM               GPIO_AF_TIM1

#define STARBOT_MOTOR2_A_PIN		 		GPIO_Pin_9
#define STARBOT_MOTOR2_A_PINSOU		 		GPIO_PinSource9
#define STARBOT_MOTOR2_A_GPIO_PORT	 		GPIOE
#define STARBOT_MOTOR2_A_GPIO_CLK	 		RCC_AHB1Periph_GPIOE
#define STARBOT_MOTOR2_B_PIN   	 	   	 	GPIO_Pin_14
#define STARBOT_MOTOR2_B_PINSOU		 		GPIO_PinSource14
#define STARBOT_MOTOR2_B_GPIO_PORT	 		GPIOE
#define STARBOT_MOTOR2_B_GPIO_CLK	 		RCC_AHB1Periph_GPIOE
#define STARBOT_MOTOR2_TIM            		TIM1
#define STARBOT_MOTOR2_TIM_CLK        		RCC_APB2Periph_TIM1
#define STARBOT_MOTOR2_A_CHANNEL			TIM_Channel_1
#define STARBOT_MOTOR2_B_CHANNEL			TIM_Channel_4
#define STARBOT_MOTOR2_AF_TIM               GPIO_AF_TIM1

#define STARBOT_MOTOR3_A_PIN		 		GPIO_Pin_7
#define STARBOT_MOTOR3_A_PINSOU		 		GPIO_PinSource7
#define STARBOT_MOTOR3_A_GPIO_PORT	 		GPIOC
#define STARBOT_MOTOR3_A_GPIO_CLK	 		RCC_AHB1Periph_GPIOC
#define STARBOT_MOTOR3_B_PIN   	 	   	 	GPIO_Pin_6
#define STARBOT_MOTOR3_B_PINSOU		 		GPIO_PinSource6
#define STARBOT_MOTOR3_B_GPIO_PORT	 		GPIOC
#define STARBOT_MOTOR3_B_GPIO_CLK	 		RCC_AHB1Periph_GPIOC
#define STARBOT_MOTOR3_TIM            		TIM8
#define STARBOT_MOTOR3_TIM_CLK        		RCC_APB2Periph_TIM8
#define STARBOT_MOTOR3_A_CHANNEL			TIM_Channel_2
#define STARBOT_MOTOR3_B_CHANNEL			TIM_Channel_1
#define STARBOT_MOTOR3_AF_TIM               GPIO_AF_TIM8

//PA8 TIM_CH1 TIM_CH1N
#define STARBOT_MOTOR4_A_PIN		 		GPIO_Pin_8
#define STARBOT_MOTOR4_A_PINSOU		 		GPIO_PinSource8
#define STARBOT_MOTOR4_A_GPIO_PORT	 		GPIOC
#define STARBOT_MOTOR4_A_GPIO_CLK	 		RCC_AHB1Periph_GPIOC
#define STARBOT_MOTOR4_B_PIN   	 	   	 	GPIO_Pin_9
#define STARBOT_MOTOR4_B_PINSOU		 		GPIO_PinSource9
#define STARBOT_MOTOR4_B_GPIO_PORT	 		GPIOC
#define STARBOT_MOTOR4_B_GPIO_CLK	 		RCC_AHB1Periph_GPIOC
#define STARBOT_MOTOR4_TIM            		TIM8
#define STARBOT_MOTOR4_TIM_CLK        		RCC_APB2Periph_TIM8
#define STARBOT_MOTOR4_A_CHANNEL			TIM_Channel_3
#define STARBOT_MOTOR4_B_CHANNEL			TIM_Channel_4
#define STARBOT_MOTOR4_AF_TIM               GPIO_AF_TIM8

#define ENCODERn 					        4
#define STARBOT_ENCODER1_A_PIN           	GPIO_Pin_0
#define STARBOT_ENCODER1_A_GPIO_PORT      	GPIOA
#define STARBOT_ENCODER1_A_GPIO_PinSource 	GPIO_PinSource0
#define STARBOT_ENCODER1_A_GPIO_CLK    		RCC_AHB1Periph_GPIOA
#define STARBOT_ENCODER1_B_PIN           	GPIO_Pin_1
#define STARBOT_ENCODER1_B_GPIO_PORT   		GPIOA
#define STARBOT_ENCODER1_B_GPIO_PinSource 	GPIO_PinSource1
#define STARBOT_ENCODER1_B_GPIO_CLK    		RCC_AHB1Periph_GPIOA
#define STARBOT_ENCODER1_TIM				TIM5
#define STARBOT_ENCODER1_TIR				TIM5_IRQn
#define STARBOT_ENCODER1_TIM_CLK 			RCC_APB1Periph_TIM5
#define STARBOT_ENCODER1_GPIO_AF_TIM      	GPIO_AF_TIM5

#define STARBOT_ENCODER2_A_PIN           	GPIO_Pin_15
#define STARBOT_ENCODER2_A_GPIO_PORT      	GPIOA
#define STARBOT_ENCODER2_A_GPIO_PinSource 	GPIO_PinSource15
#define STARBOT_ENCODER2_A_GPIO_CLK    		RCC_AHB1Periph_GPIOA
#define STARBOT_ENCODER2_B_PIN           	GPIO_Pin_3
#define STARBOT_ENCODER2_B_GPIO_PORT   		GPIOB
#define STARBOT_ENCODER2_B_GPIO_PinSource 	GPIO_PinSource3
#define STARBOT_ENCODER2_B_GPIO_CLK    		RCC_AHB1Periph_GPIOB
#define STARBOT_ENCODER2_TIM				TIM2
#define STARBOT_ENCODER2_TIR				TIM2_IRQn
#define STARBOT_ENCODER2_TIM_CLK 			RCC_APB1Periph_TIM2
#define STARBOT_ENCODER2_GPIO_AF_TIM      	GPIO_AF_TIM2

#define STARBOT_ENCODER3_A_PIN           	GPIO_Pin_6
#define STARBOT_ENCODER3_A_GPIO_PORT      	GPIOA
#define STARBOT_ENCODER3_A_GPIO_PinSource 	GPIO_PinSource6
#define STARBOT_ENCODER3_A_GPIO_CLK    		RCC_AHB1Periph_GPIOA
#define STARBOT_ENCODER3_B_PIN           	GPIO_Pin_7
#define STARBOT_ENCODER3_B_GPIO_PORT   		GPIOA
#define STARBOT_ENCODER3_B_GPIO_PinSource 	GPIO_PinSource7
#define STARBOT_ENCODER3_B_GPIO_CLK    		RCC_AHB1Periph_GPIOA
#define STARBOT_ENCODER3_TIM				TIM3
#define STARBOT_ENCODER3_TIR				TIM3_IRQn
#define STARBOT_ENCODER3_TIM_CLK 			RCC_APB1Periph_TIM3
#define STARBOT_ENCODER3_GPIO_AF_TIM      	GPIO_AF_TIM3

#define STARBOT_ENCODER3_A2_PIN           	GPIO_Pin_4
#define STARBOT_ENCODER3_A2_GPIO_PORT      	GPIOB
#define STARBOT_ENCODER3_A2_GPIO_PinSource 	GPIO_PinSource4
#define STARBOT_ENCODER3_A2_GPIO_CLK    	RCC_AHB1Periph_GPIOB
#define STARBOT_ENCODER3_B2_PIN           	GPIO_Pin_5
#define STARBOT_ENCODER3_B2_GPIO_PORT   	GPIOB
#define STARBOT_ENCODER3_B2_GPIO_PinSource 	GPIO_PinSource5
#define STARBOT_ENCODER3_B2_GPIO_CLK    	RCC_AHB1Periph_GPIOB
#define STARBOT_ENCODER3_Z_PIN           	GPIO_Pin_9
#define STARBOT_ENCODER3_Z_GPIO_PORT   		GPIOC
#define STARBOT_ENCODER3_Z_GPIO_PinSource 	GPIO_PinSource9
#define STARBOT_ENCODER3_Z_GPIO_CLK    		RCC_AHB1Periph_GPIOC

