Awacky/ros_stm32_freertos/STM32Bsp/HwConfig/hw_STM32F40x_127.h
#define STARBOT_ENCODER4_A_PIN           	GPIO_Pin_13
#define STARBOT_ENCODER4_A_GPIO_PORT      	GPIOD
#define STARBOT_ENCODER4_A_GPIO_PinSource 	GPIO_PinSource13
#define STARBOT_ENCODER4_A_GPIO_CLK    		RCC_AHB1Periph_GPIOD
#define STARBOT_ENCODER4_B_PIN           	GPIO_Pin_12
#define STARBOT_ENCODER4_B_GPIO_PORT   		GPIOD
#define STARBOT_ENCODER4_B_GPIO_PinSource 	GPIO_PinSource12
#define STARBOT_ENCODER4_B_GPIO_CLK    		RCC_AHB1Periph_GPIOD
#define STARBOT_ENCODER4_TIM				TIM4
#define STARBOT_ENCODER4_TIR				TIM4_IRQn
#define STARBOT_ENCODER4_TIM_CLK 			RCC_APB1Periph_TIM4
#define STARBOT_ENCODER4_GPIO_AF_TIM      	GPIO_AF_TIM4

/** ADC config **/
#define ADC_n								8 							
#define ADC1_DR_ADDRESS           			((u32)ADC1+0x4c)
#define STARBOT_ADC1_PIN					GPIO_Pin_2
#define STARBOT_ADC1_GPIO_PORT				GPIOA
#define STARBOT_ADC1_GPIO_CLK				RCC_AHB1Periph_GPIOA
#define STARBOT_ADC1_CHANNEL         		ADC_Channel_2

#define STARBOT_ADC2_PIN					GPIO_Pin_6
#define STARBOT_ADC2_GPIO_PORT				GPIOA
#define STARBOT_ADC2_GPIO_CLK				RCC_AHB1Periph_GPIOA
#define STARBOT_ADC2_CHANNEL         		ADC_Channel_6

#define STARBOT_M1CurrH_PIN					GPIO_Pin_6
#define STARBOT_M1CurrH_GPIO_PORT			GPIOA
#define STARBOT_M1CurrH_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M1CurrH_CHANNEL         	ADC_Channel_6

#define STARBOT_M1CurrL_PIN					GPIO_Pin_6
#define STARBOT_M1CurrL_GPIO_PORT			GPIOA
#define STARBOT_M1CurrL_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M1CurrL_CHANNEL         	ADC_Channel_6

#define STARBOT_M2CurrH_PIN					GPIO_Pin_6
#define STARBOT_M2CurrH_GPIO_PORT			GPIOA
#define STARBOT_M2CurrH_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M2CurrH_CHANNEL         	ADC_Channel_6

#define STARBOT_M2CurrL_PIN					GPIO_Pin_6
#define STARBOT_M2CurrL_GPIO_PORT			GPIOA
#define STARBOT_M2CurrL_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M2CurrL_CHANNEL         	ADC_Channel_6

#define STARBOT_M3CurrH_PIN					GPIO_Pin_6
#define STARBOT_M3CurrH_GPIO_PORT			GPIOA
#define STARBOT_M3CurrH_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M3CurrH_CHANNEL         	ADC_Channel_6

#define STARBOT_M3CurrL_PIN					GPIO_Pin_6
#define STARBOT_M3CurrL_GPIO_PORT			GPIOA
#define STARBOT_M3CurrL_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define STARBOT_M3CurrL_CHANNEL         	ADC_Channel_6

#define STARBOT_M4Curr_PIN					GPIO_Pin_6
#define STARBOT_M4Curr_GPIO_PORT			GPIOA
#define STARBOT_M4Curr_GPIO_CLK				RCC_AHB1Periph_GPIOA
#define STARBOT_M4Curr_CHANNEL         		ADC_Channel_6

/** Sonar config **/
#define SONARn 								2
#define STARBOT_SONAR1_TRIG_PIN				GPIO_Pin_1
#define STARBOT_SONAR1_TRIG_PORT			GPIOE
#define STARBOT_SONAR1_TRIG_CLK				RCC_AHB1Periph_GPIOE
#define STARBOT_SONAR1_ECHO_PIN				GPIO_Pin_9
#define STARBOT_SONAR1_ECHO_PORT			GPIOB
#define STARBOT_SONAR1_ECHO_CLK				RCC_AHB1Periph_GPIOB
#define STARBOT_SONAR1_PINSOURCE			GPIO_PinSource9
#define STARBOT_SONAR1_TIM					TIM11
#define STARBOT_SONAR1_TIM_CLK				RCC_APB2Periph_TIM11
#define STARBOT_SONAR1_AF_TIM				GPIO_AF_TIM11
#define STARBOT_SONAR1_TIM_IRQ				TIM1_TRG_COM_TIM11_IRQn
#define STARBOT_SONAR1_TIM_PSC				167
#define STARBOT_SONAR1_TIM_ARR				0XFFFF//0XFFFF
#define STARBOT_SONAR1_TRIG_ON()			GPIO_SetBits(STARBOT_SONAR1_TRIG_PORT,STARBOT_SONAR1_TRIG_PIN)
#define STARBOT_SONAR1_TRIG_OFF()			GPIO_ResetBits(STARBOT_SONAR1_TRIG_PORT,STARBOT_SONAR1_TRIG_PIN)

#define STARBOT_SONAR2_TRIG_PIN				GPIO_Pin_0
#define STARBOT_SONAR2_TRIG_PORT			GPIOE
#define STARBOT_SONAR2_TRIG_CLK				RCC_AHB1Periph_GPIOE
#define STARBOT_SONAR2_ECHO_PIN				GPIO_Pin_8
#define STARBOT_SONAR2_ECHO_PORT			GPIOB
#define STARBOT_SONAR2_ECHO_CLK				RCC_AHB1Periph_GPIOB
#define STARBOT_SONAR2_PINSOURCE			GPIO_PinSource8
#define STARBOT_SONAR2_TIM					TIM10
#define STARBOT_SONAR2_TIM_CLK				RCC_APB2Periph_TIM10
#define STARBOT_SONAR2_AF_TIM				GPIO_AF_TIM10
#define STARBOT_SONAR2_TIM_IRQ				TIM1_UP_TIM10_IRQn
#define STARBOT_SONAR2_TIM_PSC				167
#define STARBOT_SONAR2_TIM_ARR				0XFFFF
#define STARBOT_SONAR2_TRIG_ON()			GPIO_SetBits(STARBOT_SONAR2_TRIG_PORT,STARBOT_SONAR2_TRIG_PIN)
#define STARBOT_SONAR2_TRIG_OFF()			GPIO_ResetBits(STARBOT_SONAR2_TRIG_PORT,STARBOT_SONAR2_TRIG_PIN)
 

#define SERVOn 								4
#define MAX_ANGLE							270
#define STARBOT_SERVO1_PIN					GPIO_Pin_6
#define STARBOT_SERVO1_SOUPIN     			GPIO_PinSource6
#define STARBOT_SERVO1_GPIO_PORT			GPIOE
#define STARBOT_SERVO1_TIM					TIM9
#define STARBOT_SERVO1_AFTIM      			GPIO_AF_TIM9
#define STARBOT_SERVO1_CHANNEL				TIM_Channel_2
#define STARBOT_SERVO1_GPIO_CLK				RCC_AHB1Periph_GPIOE
#define STARBOT_SERVO1_TIM_CLK				RCC_APB2Periph_TIM9


#define STARBOT_SERVO2_PIN					GPIO_Pin_5
#define STARBOT_SERVO2_SOUPIN     			GPIO_PinSource5 
#define STARBOT_SERVO2_GPIO_PORT			GPIOE
#define STARBOT_SERVO2_TIM					TIM9
#define STARBOT_SERVO2_AFTIM        		GPIO_AF_TIM9
#define STARBOT_SERVO2_CHANNEL				TIM_Channel_1
#define STARBOT_SERVO2_GPIO_CLK				RCC_AHB1Periph_GPIOE
#define STARBOT_SERVO2_TIM_CLK				RCC_APB2Periph_TIM9

#define STARBOT_SERVO3_PIN					GPIO_Pin_14
#define STARBOT_SERVO3_SOUPIN     			GPIO_PinSource14
#define STARBOT_SERVO3_GPIO_PORT  			GPIOB
#define STARBOT_SERVO3_TIM					TIM12
#define STARBOT_SERVO3_AFTIM        		GPIO_AF_TIM12
#define STARBOT_SERVO3_CHANNEL				TIM_Channel_1
#define STARBOT_SERVO3_GPIO_CLK				RCC_AHB1Periph_GPIOB
#define STARBOT_SERVO3_TIM_CLK				RCC_APB1Periph_TIM12 

#define STARBOT_SERVO4_PIN					GPIO_Pin_15
#define STARBOT_SERVO4_SOUPIN     			GPIO_PinSource15
#define STARBOT_SERVO4_GPIO_PORT  			GPIOB
#define STARBOT_SERVO4_TIM					TIM12
#define STARBOT_SERVO4_AFTIM      			GPIO_AF_TIM12
#define STARBOT_SERVO4_CHANNEL				TIM_Channel_2
#define STARBOT_SERVO4_GPIO_CLK				RCC_AHB1Periph_GPIOB
#define STARBOT_SERVO4_TIM_CLK				RCC_APB1Periph_TIM12

#define STARBOT_SPI_CS_PIN					GPIO_Pin_12
#define STARBOT_SPI_CS_PORT					GPIOB
#define STARBOT_SPI_CS_CLK					RCC_AHB1Periph_GPIOB

#define STARBOT_SPI_MISO_PIN				GPIO_Pin_14
#define STARBOT_SPI_MISO_PS					GPIO_PinSource14
#define STARBOT_SPI_MISO_PORT				GPIOB
#define STARBOT_SPI_MISO_CLK				RCC_AHB1Periph_GPIOB

#define STARBOT_SPI_MOSI_PIN				GPIO_Pin_15
#define STARBOT_SPI_MOSI_PS					GPIO_PinSource15
#define STARBOT_SPI_MOSI_PORT				GPIOB
#define STARBOT_SPI_MOSI_CLK				RCC_AHB1Periph_GPIOB

