Awacky/ros_stm32_freertos/STM32Bsp/HwConfig/hw_STM32F40x_127.h
#define STARBOT_SPI_SCLK_PIN				GPIO_Pin_13
#define STARBOT_SPI_SCLK_PS					GPIO_PinSource13
#define STARBOT_SPI_SCLK_PORT				GPIOB
#define STARBOT_SPI_SCLK_CLK				RCC_AHB1Periph_GPIOB

#define STARBOT_SPI							SPI2
#define STARBOT_SPI_G_AF	 				GPIO_AF_SPI2
#define STARBOT_SPI_CLK						RCC_APB1Periph_SPI2

#define WS2812LEDn							50
#define WS2812n 							2
#define STARBOT_WS2812_1_GPIO_PORT	 		GPIOD
#define STARBOT_WS2812_1_TIM            	TIM4
#define STARBOT_WS2812_1_DMA_Stream 		DMA1_Stream0
#define STARBOT_WS2812_1_PIN		 		GPIO_Pin_12
#define STARBOT_WS2812_1_PINSOU		 		GPIO_PinSource12
#define STARBOT_WS2812_1_GPIO_CLK			RCC_AHB1Periph_GPIOD
#define STARBOT_WS2812_1_TIM_CLK        	RCC_APB1Periph_TIM4
#define STARBOT_WS2812_1_AF_TIM         	GPIO_AF_TIM4
#define STARBOT_WS2812_1_DMA_CLK        	RCC_AHB1Periph_DMA1
#define STARBOT_WS2812_1_DMA_CHANNEL		DMA_Channel_2
#define STARBOT_WS2812_1_TIM_DMA_CC 		TIM_DMA_CC1
#define STARBOT_WS2812_1_DMA_TCIF			DMA_FLAG_TCIF0

#define STARBOT_WS2812_2_GPIO_PORT	 		GPIOD
#define STARBOT_WS2812_2_TIM            	TIM4
#define STARBOT_WS2812_2_DMA_Stream 		DMA1_Stream3
#define STARBOT_WS2812_2_PIN		 		GPIO_Pin_13
#define STARBOT_WS2812_2_PINSOU		 		GPIO_PinSource13
#define STARBOT_WS2812_2_GPIO_CLK			RCC_AHB1Periph_GPIOD
#define STARBOT_WS2812_2_TIM_CLK        	RCC_APB1Periph_TIM4
#define STARBOT_WS2812_2_AF_TIM         	GPIO_AF_TIM4
#define STARBOT_WS2812_2_DMA_CLK        	RCC_AHB1Periph_DMA1
#define STARBOT_WS2812_2_DMA_CHANNEL		DMA_Channel_2
#define STARBOT_WS2812_2_TIM_DMA_CC 		TIM_DMA_CC2
#define STARBOT_WS2812_2_DMA_TCIF			DMA_FLAG_TCIF3

#define STARBOT_CAN							CAN1
#define STARBOT_CAN_AF						GPIO_AF_CAN1
#define STARBOT_CAN_CLK						RCC_APB1Periph_CAN1
#define STARBOT_CAN_IRQ	 					CAN1_RX0_IRQn
#define STARBOT_CAN_RX_IRQHandler			CAN1_RX0_IRQHandler
#define STARBOT_CAN_FilterNumber			0
#define STARBOT_CAN_TX_CLK					RCC_AHB1Periph_GPIOD
#define STARBOT_CAN_TX_GPIO_PORT			GPIOD
#define STARBOT_CAN_TX_GPIO					GPIO_Pin_0
#define STARBOT_CAN_TX_PINSOURCE			GPIO_PinSource0
#define STARBOT_CAN_RX_CLK					RCC_AHB1Periph_GPIOD
#define STARBOT_CAN_RX_GPIO_PORT			GPIOD
#define STARBOT_CAN_RX_GPIO					GPIO_Pin_1
#define STARBOT_CAN_RX_PINSOURCE			GPIO_PinSource1

/** PPM config **/
#define DEC_DUTY_CH1_PIN					GPIO_Pin_15
#define DEC_DUTY_CH1_PORT					GPIOB
#define DEC_DUTY_CH1_CLK					RCC_AHB1Periph_GPIOB
#define DEC_DUTY_CH1_PINSOURCE				GPIO_PinSource15
#define DEC_DUTY_CH2_PIN					GPIO_Pin_14
#define DEC_DUTY_CH2_PORT					GPIOB
#define DEC_DUTY_CH2_CLK					RCC_AHB1Periph_GPIOB
#define DEC_DUTY_CH2_PINSOURCE				GPIO_PinSource14
#define DEC_DUTY_TIM						TIM12
#define DEC_DUTY_TIM_CLK					RCC_APB1Periph_TIM12
#define DEC_DUTY_AF_TIM						GPIO_AF_TIM12
#define DEC_DUTY_TIM_IRQ					TIM8_BRK_TIM12_IRQn

#define DEC_DUTY_TIM_PSC					83
#define DEC_DUTY_TIM_ARR					0xFFFF

/** PPM config **/
#define DEC_PPM_PIN							GPIO_Pin_15
#define DEC_PPM_PORT						GPIOB
#define DEC_PPM_CLK							RCC_AHB1Periph_GPIOB
#define DEC_PPM_PINSOURCE					GPIO_PinSource15
#define DEC_PPM_TIM							TIM12
#define DEC_PPM_TIM_CLK						RCC_APB1Periph_TIM12
#define DEC_PPM_AF_TIM						GPIO_AF_TIM12
#define DEC_PPM_TIM_IRQ						TIM8_BRK_TIM12_IRQn

#define DEC_PPM_TIM_PSC						83
#define DEC_PPM_TIM_ARR						21000

///////////////////////DCM MOSFET////////////////////////////////

#define HW_M1UpH_GPIO						GPIOE
#define HW_M1UpL_GPIO						GPIOE
#define HW_M1DowH_GPIO						GPIOE
#define HW_M1DowL_GPIO						GPIOE
#define HW_M1UpH_PIN						GPIO_Pin_9				//PE9  TIM1_CH1
#define HW_M1UpH_SOURCE						GPIO_PinSource9
#define HW_M1UpL_PIN						GPIO_Pin_8				//PE8  TIM1_CH1N
#define HW_M1UpL_SOURCE						GPIO_PinSource8
#define HW_M1DowH_PIN						GPIO_Pin_11				//PE11 TIM1_CH2
#define HW_M1DowH_SOURCE					GPIO_PinSource11
#define HW_M1DowL_PIN						GPIO_Pin_10				//PE10 TIM1_CH2N
#define HW_M1DowL_SOURCE					GPIO_PinSource10
#define HW_M1UpH_TIM_AF						GPIO_AF_TIM1
#define HW_M1UpL_TIM_AF						GPIO_AF_TIM1
#define HW_M1DowH_TIM_AF					GPIO_AF_TIM1
#define HW_M1DowL_TIM_AF					GPIO_AF_TIM1

#define HW_M2UpH_GPIO						GPIOE
#define HW_M2UpL_GPIO						GPIOE
#define HW_M2DowH_GPIO						GPIOC
#define HW_M2DowL_GPIO						GPIOA
#define HW_M2UpH_PIN						GPIO_Pin_13				//PE13  TIM1_CH3
#define HW_M2UpH_SOURCE						GPIO_PinSource13
#define HW_M2UpL_PIN						GPIO_Pin_12				//PE12  TIM1_CH3N
#define HW_M2UpL_SOURCE						GPIO_PinSource12
#define HW_M2DowH_PIN						GPIO_Pin_6				//PC6   TIM8_CH1
#define HW_M2DowH_SOURCE					GPIO_PinSource6
#define HW_M2DowL_PIN						GPIO_Pin_7				//PA7   TIM8_CH1N
#define HW_M2DowL_SOURCE					GPIO_PinSource7
#define HW_M2UpH_TIM_AF						GPIO_AF_TIM1
#define HW_M2UpL_TIM_AF						GPIO_AF_TIM1
#define HW_M2DowH_TIM_AF					GPIO_AF_TIM8
#define HW_M2DowL_TIM_AF					GPIO_AF_TIM8

#define HW_M3UpH_GPIO						GPIOC
#define HW_M3UpL_GPIO						GPIOB
#define HW_M3DowH_GPIO						GPIOC
#define HW_M3DowL_GPIO						GPIOB
#define HW_M3UpH_PIN						GPIO_Pin_7				//PC7  TIM8_CH2
#define HW_M3UpH_SOURCE						GPIO_PinSource7
#define HW_M3UpL_PIN						GPIO_Pin_0				//PB0  TIM8_CH2N
#define HW_M3UpL_SOURCE						GPIO_PinSource0
#define HW_M3DowH_PIN						GPIO_Pin_8				//PC8  TIM8_CH3
#define HW_M3DowH_SOURCE					GPIO_PinSource8
#define HW_M3DowL_PIN						GPIO_Pin_1				//PB1  TIM8_CH3N
#define HW_M3DowL_SOURCE					GPIO_PinSource1
#define HW_M3UpH_TIM_AF						GPIO_AF_TIM8
#define HW_M3UpL_TIM_AF						GPIO_AF_TIM8
#define HW_M3DowH_TIM_AF					GPIO_AF_TIM8
#define HW_M3DowL_TIM_AF					GPIO_AF_TIM8

#define HW_M4UpH_GPIO						GPIOE
#define HW_M4DowH_GPIO						GPIOC
#define HW_M4UpH_PIN						GPIO_Pin_14				//PE14  TIM1_CH4
#define HW_M4UpH_SOURCE						GPIO_PinSource14
#define HW_M4DowH_PIN						GPIO_Pin_9				//PC9   TIM8_CH4
#define HW_M4DowH_SOURCE					GPIO_PinSource9
#define HW_M4UpH_TIM_AF						GPIO_AF_TIM1
#define HW_M4DowH_TIM_AF					GPIO_AF_TIM8
///////////////////////IO REMAP///////////////////////////
#define BITBAND(addr, bitnum) 		((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
#define MEM_ADDR(addr)              *((volatile unsigned long  *)(addr)) 
#define BIT_ADDR(addr, bitnum)   	MEM_ADDR(BITBAND(addr, bitnum)) 
//IO口地址映射
#define GPIOA_ODR_Addr    (GPIOA_BASE+20) //0x40020014
#define GPIOB_ODR_Addr    (GPIOB_BASE+20) //0x40020414 
#define GPIOC_ODR_Addr    (GPIOC_BASE+20) //0x40020814 
#define GPIOD_ODR_Addr    (GPIOD_BASE+20) //0x40020C14 
#define GPIOE_ODR_Addr    (GPIOE_BASE+20) //0x40021014 
#define GPIOF_ODR_Addr    (GPIOF_BASE+20) //0x40021414    
#define GPIOG_ODR_Addr    (GPIOG_BASE+20) //0x40021814   
#define GPIOH_ODR_Addr    (GPIOH_BASE+20) //0x40021C14    
#define GPIOI_ODR_Addr    (GPIOI_BASE+20) //0x40022014     

#define GPIOA_IDR_Addr    (GPIOA_BASE+16) //0x40020010 
#define GPIOB_IDR_Addr    (GPIOB_BASE+16) //0x40020410 
#define GPIOC_IDR_Addr    (GPIOC_BASE+16) //0x40020810 
#define GPIOD_IDR_Addr    (GPIOD_BASE+16) //0x40020C10 
#define GPIOE_IDR_Addr    (GPIOE_BASE+16) //0x40021010 
#define GPIOF_IDR_Addr    (GPIOF_BASE+16) //0x40021410 
#define GPIOG_IDR_Addr    (GPIOG_BASE+16) //0x40021810 
#define GPIOH_IDR_Addr    (GPIOH_BASE+16) //0x40021C10 
#define GPIOI_IDR_Addr    (GPIOI_BASE+16) //0x40022010 
 
//IO口操作,只对单一的IO口!
//确保n的值小于16!
#define PAout(n)   BIT_ADDR(GPIOA_ODR_Addr,n)   
#define PAin(n)    BIT_ADDR(GPIOA_IDR_Addr,n)  

#define PBout(n)   BIT_ADDR(GPIOB_ODR_Addr,n)   
#define PBin(n)    BIT_ADDR(GPIOB_IDR_Addr,n)   

#define PCout(n)   BIT_ADDR(GPIOC_ODR_Addr,n)   
#define PCin(n)    BIT_ADDR(GPIOC_IDR_Addr,n)   

#define PDout(n)   BIT_ADDR(GPIOD_ODR_Addr,n)  
#define PDin(n)    BIT_ADDR(GPIOD_IDR_Addr,n)   

#define PEout(n)   BIT_ADDR(GPIOE_ODR_Addr,n)  
#define PEin(n)    BIT_ADDR(GPIOE_IDR_Addr,n)   

#define PFout(n)   BIT_ADDR(GPIOF_ODR_Addr,n)  
#define PFin(n)    BIT_ADDR(GPIOF_IDR_Addr,n)  

#define PGout(n)   BIT_ADDR(GPIOG_ODR_Addr,n)  
#define PGin(n)    BIT_ADDR(GPIOG_IDR_Addr,n) 

#define PHout(n)   BIT_ADDR(GPIOH_ODR_Addr,n)  
#define PHin(n)    BIT_ADDR(GPIOH_IDR_Addr,n)

#define PIout(n)   BIT_ADDR(GPIOI_ODR_Addr,n)
#define PIin(n)    BIT_ADDR(GPIOI_IDR_Addr,n)


#endif // _CONFIG_H_

